In [10]:
import pandas as pd
import numpy as np

In [6]:
#series create  ma ipulate query delete
lt = [0, 2, 4, 5, 6, 7, 0, 9]
sr = pd.Series(lt)
sr

0    0
1    2
2    4
3    5
4    6
5    7
6    0
7    9
dtype: int64

In [8]:
od =[2, 3, 4, 5, 6, 0, 4, 6] 
s2 = pd.Series(lt, index =od)
s2

2    0
3    2
4    4
5    5
6    6
0    7
4    0
6    9
dtype: int64

In [17]:
#creating a series  from dictionary
dic = {'a' : 32, 'b' : 54, 'c': 54, 'd': 21, 'e': 90, 'f': 41}
s3 = pd.Series(dic)
s3

a    32
b    54
c    54
d    21
e    90
f    41
dtype: int64

In [14]:
#modify index
s3.index=['A', 'B', 'C', 'D']
s3

A    32
B    54
C    54
D    21
dtype: int64

In [16]:
#slicing
s3[:-2]

A    32
B    54
dtype: int64

In [18]:
s3

a    32
b    54
c    54
d    21
e    90
f    41
dtype: int64

In [20]:
#delete a data
s3.drop('e')

a    32
b    54
c    54
d    21
f    41
dtype: int64

In [23]:
#series operation
a1 = np.array([2, 4, 1, 2])
sr1 = pd.Series(a1)
sr1
a2 = np.array([3, 1, 0, 3, 6, 6])
sr2 = pd.Series(a2)
sr2

0    3
1    1
2    0
3    3
4    6
5    6
dtype: int32

In [24]:
#adding series 
sr1.add(sr2)

0    5.0
1    5.0
2    1.0
3    5.0
4    NaN
5    NaN
dtype: float64

In [25]:
#multiplying
sr1.mul(sr2)

0    6.0
1    4.0
2    0.0
3    6.0
4    NaN
5    NaN
dtype: float64

# create a dataframe

In [51]:
c_n = ['Amazon', 'Facebook', 'Apple', 'Google', 'Microsoft', 'Dominos']
col_dict = {'stock_code':['AM', 'FB1', 'APP', 'GOG', 'MIC', 'DOM'] ,
            'price': [1000, 432, 76, np.nan, 543, 65],
            'year': [1998, np.nan, 2001, 2015, 2016, 2017 ]}
num_ar = np.random.rand(6,3)
da = pd.DataFrame(col_dict, index= c_n)
da

          stock_code   price    year
Amazon            AM  1000.0  1998.0
Facebook         FB1   432.0     NaN
Apple            APP    76.0  2001.0
Google           GOG     NaN  2015.0
Microsoft        MIC   543.0  2016.0
Dominos          DOM    65.0  2017.0

In [29]:
da.head(3)

         stock_code  price  year
Amazon           AM   1000  1998
Facebook        FB1    432  2008
Apple           APP     76  2001

In [31]:
da.tail(3)

          stock_code  price  year
Google           GOG     21  2015
Microsoft        MIC    543  2016
Dominos          DOM     65  2017

In [33]:
da.index
da.columns

Index(['stock_code', 'price', 'year'], dtype='object')

In [34]:
da.describe()

             price         year
count     6.000000     6.000000
mean    356.166667  2009.166667
std     382.305332     8.183316
min      21.000000  1998.000000
25%      67.750000  2002.750000
50%     254.000000  2011.500000
75%     515.250000  2015.750000
max    1000.000000  2017.000000

In [35]:
#transpose
da.T

           Amazon Facebook Apple Google Microsoft Dominos
stock_code     AM      FB1   APP    GOG       MIC     DOM
price        1000      432    76     21       543      65
year         1998     2008  2001   2015      2016    2017

In [36]:
#order by
da.sort_values(by ='price')

          stock_code  price  year
Google           GOG     21  2015
Dominos          DOM     65  2017
Apple            APP     76  2001
Facebook         FB1    432  2008
Microsoft        MIC    543  2016
Amazon            AM   1000  1998

In [37]:
#slicing
da.sort_values(by ='price')[1:4]

         stock_code  price  year
Dominos         DOM     65  2017
Apple           APP     76  2001
Facebook        FB1    432  2008

In [38]:
#query dataframe by tag
da[['stock_code', 'price']]

          stock_code  price
Amazon            AM   1000
Facebook         FB1    432
Apple            APP     76
Google           GOG     21
Microsoft        MIC    543
Dominos          DOM     65

In [39]:
#copy
dt = da.copy()
dt

          stock_code  price  year
Amazon            AM   1000  1998
Facebook         FB1    432  2008
Apple            APP     76  2001
Google           GOG     21  2015
Microsoft        MIC    543  2016
Dominos          DOM     65  2017

In [40]:
da.isnull()

           stock_code  price   year
Amazon          False  False  False
Facebook        False  False  False
Apple           False  False  False
Google          False  False  False
Microsoft       False  False  False
Dominos         False  False  False

In [52]:
da.loc['Apple', 'year']= 2012
da

          stock_code   price    year
Amazon            AM  1000.0  1998.0
Facebook         FB1   432.0     NaN
Apple            APP    76.0  2012.0
Google           GOG     NaN  2015.0
Microsoft        MIC   543.0  2016.0
Dominos          DOM    65.0  2017.0

In [47]:
da.mean()

price     409.833333
year     2011.000000
dtype: float64

In [49]:
da['price'].sum()

2459

In [57]:
mn = da['price'].mean()
da['price'].fillna(mn)

Amazon       1000.0
Facebook      432.0
Apple          76.0
Google        423.2
Microsoft     543.0
Dominos        65.0
Name: price, dtype: float64

In [59]:
mn

423.2

In [60]:
#drop missing data
da.dropna(how='any')

          stock_code   price    year
Amazon            AM  1000.0  1998.0
Apple            APP    76.0  2012.0
Microsoft        MIC   543.0  2016.0
Dominos          DOM    65.0  2017.0

##DAta frame file operation